squeaker/app/controllers/api/squeaks_controller.rb

  def index
    # debugger
    @squeaks = Squeak.all
---
SELECT "squeaks".* FROM "squeaks"

  def create
    @squeak = Squeak.new(squeak_params)
    debugger
    if @squeak.save
---
INSERT INTO "squeaks" ("body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "hello"], ["author_id", 1], ["created_at", "2020-05-25 15:07:02.921374"], ["updated_at", "2020-05-25 15:07:02.921374"]]